Revit 2027 API
ComponentRepeaterIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ComponentRepeaterSlot Current { get; }
Public Overridable ReadOnly Property Current As ComponentRepeaterSlot
	Get
public:
virtual property ComponentRepeaterSlot^ Current {
	ComponentRepeaterSlot^ get ();
}
abstract Current : ComponentRepeaterSlot with get
override Current : ComponentRepeaterSlot with get
Property Value
ComponentRepeaterSlot
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
ComponentRepeaterIterator Class
Autodesk.Revit.DB Namespace